//
//  Lyrics.swift
//  ProgresSing
//
//  Created by 남경민 on 2023/02/14.
//

import Foundation


struct Lyrics {
    var koreanLyrics : [String]
    var englishLyrics : [String]
    var startLyricsTime1 : [String]
    var endLyricsTime1 : [String]
    var startLyricsTime2 : [String]
    var endLyricsTime2 : [String]
    
    var vocalFryTime : [Float]
    var beltTime : [Float]
    var vibratoTime : [Float]
    var mr_sec: [(Float, Float, String)]

    init() {
        self.koreanLyrics = [
            "찢어진 종잇조각에",
            "담아낸 나의 진심에",
            "선명해져 somethin' bout you",
            "Yeah 나를 많이 닮은 듯 다른",
            "넌 혹시 나와 같을까 지금",
            "괜한 기대를 해~",
            "하루 한 달 일 년쯤 되면~",
            "서로 다른 일상을 살아가~",
            "나는 아니야",
            "쉽지 않을 것 같아",
            "여전하게도 넌 내 하루하루를 채우고~",
            "아직은 아니야",
            "바보처럼 되뇌는 나",
            "입가에 맴도는 말을 삼킬 수 없어~",
            "It's not fine(Ah~Ah~Ah~Ah~)",
            "It's not fine",
            "머릴 질끈 묶은 채",
            "어지러운 방을 정리해",
            "찾고 있어 something new",
            "가끔 이렇게 감당할 수 없는",
            "뭐라도 해야 할 것만 같은 기분에",
            "괜히 움직이곤 해",
            "하~루 한 달 일 년 그쯤이면~",
            "웃으며 추억할 거라 했지만",
            "나는 아니야",
            "쉽지 않을 것 같아",
            "여전하게도 넌 내 하루하루를 채우고~",
            "아직은 아니야",
            "바보처럼 되뇌는 나",
            "입가에 맴도는 말을 삼킬 수 없어~",
            "It's not fine(Ah~Ah~Ah~Ah~)",
            //"(It's not fine)",
            "It's not fine",
            "의미 없는 농담 주고받는 대화",
            "사람들 틈에 난 아~무렇지 않아 보~여",
            "무딘 척 웃음을 지어 보이며~",
            "너란 그늘을 애써 외면해보지만",
            "우리 마지막",
            "그 순간이 자꾸 떠올라",
            "잘 지내란 말이 전부였던 담담한 이별",
            "아직은 아니야",
            "바보처럼 되뇌는 그 말",
            "입가에 맴도는 말을 삼킬 수 없어",
            "It's not fine(Ah~Ah~Ah~)",
            "It's not fine(Ah~Ah~Ah~)",
            "It's not fine"
        ]
        self.englishLyrics = []
        
        self.startLyricsTime1 = [
            "00:06",
            "00:11",
            "00:20",
            "00:27",
            "00:38",
            "00:44",
            "00:52",
            "01:00",
            "01:12",
            "01:17",
            "01:25",
            "01:34",
            "01:45",
            "01:50",
            "01:58",
            "02:06",
            "02:18",
            "02:29",
            "02:40",
            "02:45",
            "02:53",
            "03:01",
            "03:23"
        ]
        self.endLyricsTime1 = [
            "00:08",
            "00:15",
            "00:22",
            "00:33",
            "00:40",
            "00:49",
            "00:54",
            "01:10",
            "01:14",
            "01:22",
            "01:28",
            "01:39",
            "01:46",
            "01:55",
            "02:00",
            "02:16",
            "02:23",
            "02:34",
            "02:41",
            "02:50",
            "02:56",
            "03:12",
            "03:25"
        ]
        
        self.startLyricsTime2 = [
            "00:08",
            "00:17",
            "00:23",
            "00:33",
            "00:41",
            "00:49",
            "00:55",
            "01:10",
            "01:14",
            "01:23",
            "01:29",
            "01:39",
            "01:47",
            "01:55",
            "02:01",
            "02:16",
            "02:23",
            "02:34",
            "02:42",
            "02:51",
            "02:56",
            "03:12"
            
            
        ]
        self.endLyricsTime2 = [
            
            "00:11",
            "00:19",
            "00:26",
            "00:38",
            "00:43",
            "00:51",
            "00:59",
            "01:12",
            "01:17",
            "01:25",
            "01:33",
            "01:44",
            "01:49",
            "01:58",
            "02:05",
            "02:18",
            "02:29",
            "02:40",
            "02:44",
            "02:52",
            "03:01",
            "03:23"
            
        ]
        self.vocalFryTime = [
            6,9,14,17,
            18,20,
            75,80,86,90,96.5,
            100,
            142
        ]
        self.beltTime = [
            28,29,
            31,
            39,
            50,
            53,
            96,97,
            103,
            105,
            108,
            116,
            119,
            161,163,171,174
        ]
        self.vibratoTime = [
            26,
            32,
            37,
            48,
            59,
            81,
            94,
            99,
            114,
            125,
            147,149,154
        ]
        
        self.mr_sec = [(6.5,   6.9, "vocal_fry"),
                       (  9.5,   9.9, "vocal_fry"),
                       ( 13.6,  14.0, "vocal_fry"),
                       ( 17.2,  17.6, "vocal_fry"),
                       ( 17.6,  18.0, "vocal_fry"),
                       ( 20.5,  20.9, "vocal_fry"),
                       ( 25.7,  26.1, "vibrato"),
                       ( 28.2,  28.6, "belt"),
                       ( 29.6,  30.0, "belt"),
                       ( 31.0,  31.4, "belt"),
                       ( 32.5,  32.9, "vibrato"),
                       ( 36.5,  36.9, "vibrato"),
                       ( 39.3,  39.7, "belt"),
                       ( 47.9,  48.3, "vibrato"),
                       ( 50.2,  50.6, "belt"),
                       ( 52.6,  53.0, "belt"),
                       ( 59.0,  59.4, "vibrato"),
                       
                       ( 75.0,  75.4, "vocal_fry"),
                       ( 80.4,  80.8, "vocal_fry"),
                       ( 80.7,  81.1, "belt"),
                       ( 86.0,  86.4, "vocal_fry"),
                       ( 90.2,  90.6, "vocal_fry"),
                       
                       ( 94.5,  94.9, "vibrato"),
                       ( 95.8,  96.2, "belt"), 
                       ( 96.4,  96.8, "vocal_fry"),
                       ( 97.3,  97.7, "belt"),
                       ( 98.6,  99.0, "vibrato"),
                       ( 99.9, 100.3, "vocal_fry"),
                       (102.9, 103.3, "belt"),
                       (105.5, 105.9, "belt"),
                       (107.4, 107.8, "belt"),
                       (114.1, 114.5, "vibrato"),
                       
                       (116.4, 116.8, "belt"),
                       (118.8, 119.2, "belt"),
                       (125.2, 125.6, "vibrato"),
                       (142.1, 142.5, "vocal_fry"),
                       (147.1, 147.5, "vibrato"),
                       
                       (149.3, 149.7, "vibrato"),
                       (153.9, 154.3, "vibrato"),
                       (160.7, 161.1, "belt"),
                       (163.0, 163.4, "belt"),
                       (171.6, 172.0, "belt"),
                       (174.3, 174.7, "belt")
        ]
    }
}
